Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus comes with built-in security to allow for Role-Based Access Control (link:https://en.wikipedia.org/wiki/Role-based_access_control[RBAC]) based on the common security annotations `@RolesAllowed`, `@DenyAll`, `@PermitAll` on REST endpoints and CDI beans. An example of an endpoint that makes use of both JAX-RS and Common Security annotations to describe and secure its endpoints is given in <<subject-example>>. Quarkus also provides the `io.quarkus.security.Authenticated` annotation that will permit any authenticated user to access the resource (equivalent to `@RolesAllowed("**")`).
ja_jp: Quarkusには、共通のセキュリティーアノテーション( `@RolesAllowed` , `@DenyAll` , `@PermitAll` )に基づいたロールベースのアクセス制御 link:https://en.wikipedia.org/wiki/Role-based_access_control[(RBAC] )をRESTエンドポイントとCDI Bean上で可能にするためのビルトインセキュリティーが搭載されています。JAX-RSとCommon Securityアノテーションの両方を利用してエンドポイントを記述し、セキュリティーを確保するエンドポイントの例は、 link:#subject-example[[subject-example]] に記載されています。Quarkusはまた、認証済みのユーザーがリソースにアクセスすることを許可する `io.quarkus.security.Authenticated` アノテーションも提供しています( `@RolesAllowed("**")` と同等です)。

source: Quarkus comes with default profiles (`dev`, `test` and `prod`). And you can add your own custom profiles to describe various environments (`staging`, `prod-us`, etc).
ja_jp: Quarkusにはデフォルトのプロファイルが付属しています ( `dev` , `test` と `prod` )。また、様々な環境を記述するために独自のカスタムプロファイルを追加することができます ( `staging` , `prod-us` , など )。

source: Quarkus component variants
ja_jp: Quarkus コンポーネントバリアント

source: Quarkus configuration
ja_jp: Quarkus の設定

source: Quarkus configuration system, will automatically decrypt the configuration value when looking up `my.secret`.
ja_jp: Quarkusの設定システムでは、 `my.secret` を検索する際に、設定値が自動的に復号化されます。

source: Quarkus configurations
ja_jp: Quarkusの構成

source: Quarkus configures a Bean of type `KubernetesClient` which can be injected into application code using the well known CDI methods. This client can be configured using various properties as can be seen in the following example:
ja_jp: Quarkusは、よく知られたCDIメソッドを使用してアプリケーションコードに注入できる `KubernetesClient` タイプのBeanを設定します。このクライアントは、以下の例にあるように、さまざまなプロパティーを使用して設定することができます。

source: Quarkus continues to improve and work well with native-image, and lately Project Leyden enabled us to strengthen the JVM side of that equation.
ja_jp: Quarkus はネイティブイメージとの連携を改善し続けており、最近では Project Leyden のおかげで、この方程式の JVM 側を強化することができました。

source: Quarkus core extensions instrumented with Micrometer
ja_jp: Micrometerで計測されたQuarkusのコアエクステンション

source: Quarkus core extensions instrumented with OpenTelemetry tracing
ja_jp: OpenTelemetry Tracing で計装された Quarkus コアエクステンション

source: Quarkus could be accessed through proxies that additionally generate headers (e.g. `X-Forwarded-Host`) to keep information from the client-facing side of the proxy servers that is altered or lost when they are involved. In those scenarios, Quarkus can be configured to automatically update information like protocol, host, port and URI reflecting the values in these headers.
ja_jp: Quarkus は、プロキシーサーバーが関与すると変更されたり失われたりするクライアント側の情報を保持するために、追加でヘッダー ( 例： `X-Forwarded-Host` ) を生成するプロキシーを介してアクセスされる可能性があります。このようなシナリオでは、 Quarkus は、これらのヘッダーの値を反映して、プロトコル、ホスト、ポート、 URI などの情報を自動的に更新するように設定することができます。

source: Quarkus creates a unique state cookie name every time a new authorization code flow is started to support multi-tab authentication. Many concurrent authentication requests on behalf of the same user can cause multiple state cookies to be created.
ja_jp: Quarkus は、マルチタブ認証をサポートするために、新しい認可コードフローが開始されるたびに一意の状態 Cookie 名を作成します。 同じユーザーによる多数の同時認証リクエストにより、多数の状態 Cookie が作成される場合があります。

source: Quarkus creates a unique state cookie name every time a new authorization code flow is started to support multi-tab authentication. Many concurrent authentication requests on behalf of the same user may cause a lot of state cookies be created. If you do not want to allow your users use multiple browser tabs to authenticate then it is recommended to disable it with `quarkus.oidc.authentication.allow-multiple-code-flows=false`. It also ensures that the same state cookie name is created for every new user authentication.
ja_jp: Quarkus は、マルチタブ認証をサポートするために、新しい認可コードフローが開始されるたびに一意の状態 Cookie 名を作成します。同じユーザーによる多数の同時認証リクエストにより、多数の状態 Cookie が作成される場合があります。 ユーザーに対して、複数のブラウザータブを使用した認証を許可しない場合は、 `quarkus.oidc.authentication.allow-multiple-code-flows=false` で無効にすることが推奨されます。これにより、新しいユーザー認証ごとに同じ状態 Cookie 名が作成されます。

source: Quarkus creates the virtual thread to invoke your endpoint (because of the `@RunOnVirtualThread` annotation).
ja_jp: Quarkusは、（ `@RunOnVirtualThread` アノテーションのため）エンドポイントを呼び出すための仮想スレッドを作成します。

source: Quarkus currently includes the following built-in database kinds:
ja_jp: Quarkusには現在、以下のデータベースのdb-kindが組み込まれています：

source: Quarkus currently only supports a subset of the functionalities that Spring @Scheduled provides with more features being planned. Currently, the `fixedDelay` and `fixedDelayString` parameters are not supported, in other words, `@Scheduled` methods are always executed independently.
ja_jp: Quarkusは現在、Spring @Scheduledが提供する機能のサブセットのみをサポートしており、さらに多くの機能が計画されています。現在のところ、 `fixedDelay` と `fixedDelayString` のパラメータはサポートされていません。言い換えれば、 `@Scheduled` のメソッドは常に独立して実行されるということです。

source: Quarkus currently only supports a subset of the functionalities that Spring Security provides with more features being planned. More specifically, Quarkus supports the security related features of role-based authorization semantics (think of `@Secured` instead of `@RolesAllowed`).
ja_jp: Quarkus は現在、Spring Security が提供する機能のサブセットのみをサポートしていますが、今後はさらに多くの機能のサポートが計画されています。より具体的には、Quarkus は、ロールベースの承認セマンティクスのセキュリティー関連機能をサポートします (`@RolesAllowed` ではなく `@Secured` を考えてください)。

source: Quarkus currently only supports a subset of the functionality that Spring Security provides with more features being planned. More specifically, Quarkus supports the security related features of role-based authorization semantics (think of `@Secured` instead of `@RolesAllowed`).
ja_jp: Quarkusは現在、Spring Securityが提供する機能のサブセットのみをサポートしています。具体的には、Quarkusはロールベースの認可セマンティクスのセキュリティ関連機能をサポートしています（ `@RolesAllowed` の代わりの `@Secured` を考えてみてください）。

source: Quarkus currently supports a subset of Spring Data JPA's features, namely the most useful and most commonly used features.
ja_jp: Quarkus は現在、Spring Data JPA の機能のサブセット、つまり最も有用で最も一般的に使用される機能をサポートしています。

source: Quarkus currently supports a subset of Spring Data REST features, namely the most useful and most commonly used features.
ja_jp: Quarkusは現在、Spring Data RESTの機能のうち、最も便利でよく使われる機能のサブセットをサポートしています。

source: Quarkus currently supports a subset of the functionalities that Spring Web provides. More specifically Quarkus supports the REST related features of Spring Web (think of `@RestController` instead of `@Controller`).
ja_jp: Quarkusは現在、Spring Webが提供する機能のサブセットをサポートしています。具体的には、QuarkusはSpring WebのREST関連の機能をサポートしています（ `@Controller` の代わりに `@RestController` を考えてみてください）。

source: Quarkus currently supports the link:{hibernate-orm-docs-url}#multitenacy-separate-database[separate database] approach, the link:{hibernate-orm-docs-url}#multitenacy-separate-schema[separate schema] approach and the link:{hibernate-orm-docs-url}#multitenacy-discriminator[discriminator] approach.
ja_jp: Quarkus は現在、link:{hibernate-orm-docs-url}#multitenacy-separate-database[別々のデータベース] を使用する方法、link:{hibernate-orm-docs-url}#multitenacy-separate-schema[別々のスキーマ] を使用する方法、および link:{hibernate-orm-docs-url}#multitenacy-discriminator[discriminator] を使用する方法をサポートしています。

source: Quarkus currently supports the link:{orm-doc-url-prefix}#multitenacy-separate-database[separate database] and the link:{orm-doc-url-prefix}#multitenacy-separate-schema[separate schema] approach.
ja_jp: Quarkusは現在、 link:{orm-doc-url-prefix}#multitenacy-separate-database[独立したデータベース]と link:{orm-doc-url-prefix}#multitenacy-separate-schema[独立したスキーマ]のアプローチをサポートしています。

source: Quarkus deduces the JDBC driver class it needs to use from the specified value of the `db-kind` database platform attribute.
ja_jp: Quarkusは、 `db-kind` データベースプラットフォーム属性の指定値から、使用するJDBCドライバクラスを推測します。

source: Quarkus defaults to server applications, so we switch to a better default by setting `-H:InitialCollectionPolicy=com.oracle.svm.core.genscavenge.CollectionPolicy$BySpaceAndTime`.
ja_jp: Quarkusのデフォルトはサーバーアプリケーションになっているので、 `-H:InitialCollectionPolicy=com.oracle.svm.core.genscavenge.CollectionPolicy$BySpaceAndTime` によってより良いデフォルト値に切り替えています。

source: Quarkus delivers performance through four key dimensions:
ja_jp: Quarkus は、次の 4 つの主要な側面を通じてパフォーマンスを提供します。

source: Quarkus derives the JDBC driver class from the `db-kind` database platform value.
ja_jp: Quarkus は、 `db-kind` データベースプラットフォームの値から JDBC ドライバークラスを導出します。

source: Quarkus detects Compose files named `compose-devservices.yml` (or <<compose-devservices-compose-files>>) in your project and starts the defined services when your application runs in development or test mode. Extensions providing dev services discover these custom services and use them instead of creating default ones. When the dev mode or tests are stopped, the services are automatically stopped and cleaned up.
ja_jp: Quarkus は、プロジェクト内の `compose-devservices.yml` ファイル (または <<compose-devservices-compose-files>>) を検出し、アプリケーションが開発モードまたはテストモードで実行されるときに定義されたサービスを起動します。dev services を提供するエクステンションは、これらのカスタムサービスを発見し、デフォルトのサービスを作成する代わりにそれらを使用します。開発モードまたはテストが停止すると、サービスは自動的に停止してクリーンアップされます。

source: Quarkus detects and removes unused beans to help you on your way to a subatomic application. And if something goes wrong, there are options that make it possible to configure the behavior of this optimization.
ja_jp: Quarkusは、使用されていないBeanを検出して削除し、サブアトミックアプリケーションへの道を支援します。また、何か問題が発生した場合には、この最適化の動作を設定できるオプションが用意されています。

source: Quarkus detects possible namespace collisions and fails the build if a specific namespace is defined by multiple `@TemplateData` and/or `@TemplateEnum` annotations.
ja_jp: Quarkus は、名前空間の競合の可能性を検出し、特定の名前空間が複数の `@TemplateData` や `@TemplateEnum` アノテーションによって定義されている場合、ビルドを失敗させます。

source: Quarkus dev mode does not work currently with Azure Functions.
ja_jp: Quarkusの開発モードは、現在Azure Functionsでは動作しません。

source: Quarkus dev mode works by just running your application as a HTTP endpoint. In dev mode there is no special interaction with the Azure Functions local runtime.
ja_jp: Quarkus 開発モードは、アプリケーションを HTTP エンドポイントとして実行するだけで使用できます。開発モードでは、 Azure Functions ローカルランタイムとの特別なやり取りはありません。

source: Quarkus dev mode works by just running your application as an HTTP endpoint. In dev mode, there is no special interaction with the Azure Functions local runtime.
ja_jp: Quarkus 開発モードは、アプリケーションを HTTP エンドポイントとして実行するだけで機能します。開発モードでは、Azure Functions ローカルランタイムとの特別なやり取りはありません。

source: Quarkus dev mode works with the defined repositories just like with any other Quarkus extension, greatly enhancing your productivity during the dev cycle. The application can be started in dev mode as usual using:
ja_jp: Quarkus 開発モードは、他の Quarkus エクステンションと同じように、定義済みリポジトリーで機能し、開発サイクル中の生産性を大幅に向上させます。アプリケーションは、通常どおり、以下を使用して開発モードで起動できます。

source: Quarkus developers have continually commented how easy it is to understand the framework and create meaningful applications. Developers at Abraxas had the same experience but wanted to take things a step further. They created a custom “Hello, world!” application training project to make it easy for new developers on their team to learn how to implement Quarkus. The project includes PostgreSQL, Kafka and REST endpoints. New developers are typically up and running with the technology within 1-2 weeks which makes it easy to onboard new developers.
ja_jp: Quarkusの開発者は、フレームワークを理解して有意義なアプリケーションを作成するのがいかに簡単かということを常にコメントしています。Abraxasの開発者も同じ経験をしましたが、さらに一歩先に進みたいと考えていました。彼らは、チームの新しい開発者がQuarkusの導入方法を簡単に学べるように、カスタムの「Hello, world!このプロジェクトには、PostgreSQL、Kafka、RESTエンドポイントが含まれています。新しい開発者は通常1～2週間でこの技術を使いこなせるようになり、新しい開発者の受け入れが容易になりました。

source: Quarkus development mode is really useful for applications that mix front end or services and database access.
ja_jp: Quarkusの開発モードはフロントエンドやサービス、データベースアクセスが混在するアプリケーションにとても便利です。

source: Quarkus didn't achieve fast startup and low memory footprint by using dark magic or lazy loading tricks but by entirely rethinking the way Java applications are bootstrapped. The whole point of Quarkus is to move as much work as possible to the build time and this journey made us create a framework to push work at build time that can be leveraged in Quarkus extensions.
ja_jp: Quarkusは、黒魔術や遅延ローディングのトリックを使って高速起動と低メモリフットプリントを実現したのではなく、Javaアプリケーションのブートストラップ方法を全面的に再考しました。Quarkusの全体的なポイントは、できるだけ多くの作業をビルド時に移動させることです。この移動のために、我々はビルド時に作業を進めるためのフレームワークを作成し、Quarkusのエクステンションで活用できるようになりました。

source: Quarkus disables Java Management Extensions (JMX) support because it does not work in native mode.
ja_jp: Quarkus は、ネイティブモードで動作しないため、Java Management Extensions (JMX) のサポートを無効にします。

source: Quarkus disables Oracle Cloud Infrastructure (OCI) integration because it does not work in native mode.
ja_jp: Quarkus は、ネイティブモードで動作しないため、Oracle Cloud Infrastructure (OCI) インテグレーションを無効にします。

source: Quarkus disables the MySQL Connector/J OpenTelemetry integration and relies on the Agroal integration instead.
ja_jp: Quarkus は MySQL Connector/J の OpenTelemetry インテグレーションを無効にし、代わりに Agroal インテグレーションを利用します。

source: Quarkus disables this feature by setting `-H:FallbackThreshold=0`: this will ensure you get a compilation failure rather risking to not notice that the application is unable to really run in native mode.
ja_jp: Quarkusは、 `-H:FallbackThreshold=0` を設定することでこの機能を無効にします。これにより、アプリケーションが本当にネイティブモードで実行できないことに気づかないリスクの代わりに、コンパイルに失敗するように出来ます。

source: Quarkus doc sources are built and synced to the https://quarkus.io/guides/[Quarkus.io website] at release time.
ja_jp: Quarkus のドキュメントソースは、リリース時にビルドされ、 https://quarkus.io/guides/[Quarkus.io のウェブサイト] に同期されます。

source: Quarkus docs are built from source written using {asciidoc}[Asciidoc], a lightweight markup language.
ja_jp: Quarkus のドキュメントは、軽量マークアップ言語である {asciidoc}[Asciidoc] を使用して、記述されたソースからビルドされます。

source: Quarkus docs are stored in a fairly flat structure in an effort to make things easier to discover. The bulk of the file name should be some representation of its title. Use all lowercase letters, separate words with hyphens, and don't use symbols or special characters.
ja_jp: Quarkus のドキュメントは、発見しやすくするために、かなりフラットな構造で保存されています。ファイル名の大部分は、そのタイトルを表すものでなければなりません。すべて小文字を使用し、単語はハイフンで区切り、記号や特殊文字は使用しないでください。

source: Quarkus docs use AsciiDoc syntax. The following links provide background on AsciiDoc syntax and general conventions.
ja_jp: Quarkusのドキュメントでは、AsciiDoc構文が使用されています。以下のリンクは、AsciiDocの構文と一般的な規約に関する背景を説明しています。

source: Quarkus docs use Asciidoc syntax. The following links provide background on Asciidoc syntax and general conventions.
ja_jp: Quarkus docs は、Asciidoc 構文を使用しています。次のリンクは、Asciidoc の構文と一般的な規則に関する背景を説明しています。

source: Quarkus docs use link:https://asciidoc.org/[AsciiDoc] markup.
ja_jp: Quarkusのドキュメントには、 link:https://asciidoc.org/[AsciiDoc] のマークアップが使用されています。

source: Quarkus documentation concepts
ja_jp: Quarkus ドキュメントのコンセプト

source: Quarkus documentation content types
ja_jp: Quarkusドキュメントのコンテンツタイプ

source: Quarkus documentation is built from source in a few different environments.
ja_jp: Quarkus のドキュメントは、いくつかの異なる環境でソースから構築されています。

source: Quarkus documentation is built from source in a few different environments. We use attributes in our cross-references to ensure our docs can be built across these environments.
ja_jp: Quarkus のドキュメントは、いくつかの異なる環境でソースから構築されています。相互参照で属性を使用して、これらの環境全体でドキュメントを構築できるようにします。

source: Quarkus documentation is grouped into the following categories.
ja_jp: Quarkusのドキュメントは、以下のカテゴリーに分類されています。

source: Quarkus documentation is structured into four distinct content types: concepts, how-tos, tutorials, and references.
ja_jp: Quarkusのドキュメントは、コンセプト、ハウツー、チュートリアル、リファレンスの4つのコンテンツタイプに分類されます。

source: Quarkus documentation is structured into four distinct content types: concepts, how-tos, tutorials, and references. The composition and structure of Quarkus docs follow the Diátaxis systematic documentation framework for technical documentation authoring. Each content type resolves a different user need, fulfills a different purpose, and requires a different approach to its creation.
ja_jp: Quarkusのドキュメントは、コンセプト、ハウツー、チュートリアル、リファレンスの4つのコンテンツタイプに分類されています。Quarkusドキュメントの構成と構造は、技術文書オーサリングのためのDiátaxis体系的文書フレームワークに従っています。各コンテンツタイプは、異なるユーザーニーズを解決し、異なる目的を果たし、その作成に異なるアプローチを必要とします。

source: Quarkus documentation uses a flat hierarchy.
ja_jp: Quarkus ドキュメントはフラットなヒエラルキーを使用します。

source: Quarkus documentation uses asciidoc syntax.
ja_jp: Quarkusのドキュメントでは、asciidoc構文が使用されています。

source: Quarkus documentation uses link:https://asciidoc.org/[AsciiDoc] markup.
ja_jp: Quarkusのドキュメントでは、 link:https://asciidoc.org/[AsciiDoc] のマークアップを使用しています。

source: Quarkus documentation variables
ja_jp: Quarkus ドキュメント変数

source: Quarkus does not modify the libraries it uses; this rule applies to Hibernate ORM as well: when using this extension you will mostly have the same experience as using the original library.
ja_jp: Quarkusは使用するライブラリを変更しません。このルールはHibernate ORMにも適用されます。このエクステンションを使用すると、元のライブラリを使用した場合とほとんど同じエクスペリエンスが得られます。

source: Quarkus does not modify the libraries it uses; this rule applies to Hibernate Reactive as well: when using this extension you will mostly have the same experience as using the original library.
ja_jp: Quarkusは使用しているライブラリを修正しません。このルールはHibernate Reactiveにも適用されます。このエクステンションを使用すると、ほとんどの場合、元のライブラリを使用するのと同じ経験ができます。

source: Quarkus does not provide any way to initialize a Gradle project for extensions yet.
ja_jp: Quarkus は、エクステンションのGradleプロジェクトを初期化する方法を提供していません。

source: Quarkus does that for you automatically by analyzing the REST methods at build time and that's why we didn't need any reflection registration in the first part of this guide.
ja_jp: Quarkusは、ビルド時にRESTメソッドを分析することで、自動的にそのような処理を行ってくれます。

source: Quarkus does that for you automatically by analyzing the REST methods at build time, and that is why we did not need any reflection registration in the first part of this guide.
ja_jp: Quarkus は、ビルド時に REST メソッドを分析することで、このような処理を自動的に実行します。そのため、このガイドの最初の部分ではリフレクション登録は必要ありませんでした。

source: Quarkus enables Java developers to create performant, easily deployable, and maintainable applications on Kubernetes. This release includes a number of impactful Kubernetes-native features including new Dev Services for Kubernetes deployments.
ja_jp: Quarkusを使用すると、Java開発者はKubernetes上でパフォーマンスが高く、簡単にデプロイでき、保守可能なアプリケーションを作成できます。このリリースには、Kubernetesデプロイメント用の新しいDev Servicesを含む、Kubernetes-nativeのインパクトのある機能が多数含まれています。

source: Quarkus enables the inclusion or exclusion of JAX-RS Resources, Providers and Features directly thanks to build time conditions in the same that it does for CDI beans. Thus, the various JAX-RS classes can be annotated with profile conditions (`@io.quarkus.arc.profile.IfBuildProfile` or `@io.quarkus.arc.profile.UnlessBuildProfile`) and/or with property conditions (`io.quarkus.arc.properties.IfBuildProperty` or `io.quarkus.arc.properties.UnlessBuildProperty`) to indicate to Quarkus at build time under which conditions these JAX-RS classes should be included.
ja_jp: Quarkusでは、CDI Beanの場合と同様に、ビルド時の条件に応じて、JAX-RSリソース、プロバイダー、および機能を直接包含または除外することができます。したがって、さまざまなJAX-RSクラスは、プロファイル条件（ `@io.quarkus.arc.profile.IfBuildProfile` または `@io.quarkus.arc.profile.UnlessBuildProfile` ）および／またはプロパティ条件（ `io.quarkus.arc.properties.IfBuildProperty` または `io.quarkus.arc.properties.UnlessBuildProperty` ）でアノテーションすることができ、構築時にどの条件でこれらのJAX-RSクラスが含まれるべきかをQuarkusに示すことができます。

source: Quarkus enables the inclusion or exclusion of Jakarta REST Resources, Providers and Features directly thanks to build time conditions in the same that it does for CDI beans. Thus, the REST Data with Panache interfaces can be annotated with profile conditions (`@io.quarkus.arc.profile.IfBuildProfile` or `@io.quarkus.arc.profile.UnlessBuildProfile`) and/or with property conditions (`io.quarkus.arc.properties.IfBuildProperty` or `io.quarkus.arc.properties.UnlessBuildProperty`) to indicate to Quarkus at build time under which conditions the generated Jakarta REST classes should be included.
ja_jp: Quarkusでは、CDI Beanの場合と同様に、ビルド時の条件によって、Jakarta RESTリソース、プロバイダ、フィーチャーを直接追加または除外できます。 したがって、REST Data with Panacheインターフェイスにプロファイル条件（ `@io.quarkus.arc.profile.IfBuildProfile` または `@io.quarkus.arc.profile.UnlessBuildProfile` ）やプロパティ条件（ `io.quarkus.arc.properties.IfBuildProperty` または `io.quarkus.arc.properties.UnlessBuildProperty` ）をアノテーションすることで、生成されるJakarta RESTクラスをどの条件で含めるかを、ビルド時にQuarkusに指示することができます。

source: Quarkus enables the inclusion or exclusion of Jakarta REST Resources, Providers and Features directly thanks to build time conditions in the same that it does for CDI beans. Thus, the various Jakarta REST classes can be annotated with profile conditions (`@io.quarkus.arc.profile.IfBuildProfile` or `@io.quarkus.arc.profile.UnlessBuildProfile`) and/or with property conditions (`io.quarkus.arc.properties.IfBuildProperty` or `io.quarkus.arc.properties.UnlessBuildProperty`) to indicate to Quarkus at build time under which conditions these Jakarta REST classes should be included.
ja_jp: Quarkusでは、CDI Beanと同様に、ビルド時の条件によって、Jakarta RESTリソース、プロバイダ、フィーチャーを直接取り込んだり除外したりすることができます。したがって、さまざまなJakarta RESTクラスにプロファイル条件（ `@io.quarkus.arc.profile.IfBuildProfile` または `@io.quarkus.arc.profile.UnlessBuildProfile` ）やプロパティ条件（ `io.quarkus.arc.properties.IfBuildProperty` または `io.quarkus.arc.properties.UnlessBuildProperty` ）をアノテーションして、ビルド時にQuarkusに対して、どのような条件の下でJakarta RESTクラスを含めるべきかを示すことができます。

source: Quarkus exposes a high-level API on top of Redis. This API is type-safe and structured around the notion of _group_, inherited from the https://redis.io/commands/command-docs/[Redis command organization]. This API lets you execute Redis commands more conveniently and safely.
ja_jp: Quarkus は、Redis 上で高レベルの API を公開します。この API はタイプセーフで https://redis.io/commands/command-docs/[Redis コマンド編成] から継承された _グループ_ の概念を中心とした構造となっています。この API を使用すると、Redis コマンドをより便利かつ安全に実行することができます。

source: Quarkus exposes all Kafka related application properties, prefixed with `kafka.` or `KAFKA_` inside a configuration map with `default-kafka-broker` name. This configuration is used to establish the connection with the Kafka broker.
ja_jp: Quarkus は、 `default-kafka-broker` 名の設定マップ内に接頭辞 `kafka.` または `KAFKA_` が付いたすべての Kafka 関連アプリケーションプロパティーを公開します。この設定は、Kafka ブローカーとの接続を確立するために使用されます。

source: Quarkus exposes both the reflection service `v1` and `v1alpha`.
ja_jp: Quarkusは、リフレクションサービス `v1` と `v1alpha` の両方を公開しています。

source: Quarkus exposes some technical endpoints that are not part of your application (for example, the Health endpoints).
ja_jp: Quarkusでは、アプリケーションの一部ではない技術的なエンドポイント(Healthエンドポイントなど)をいくつか公開しています。

source: Quarkus extension
ja_jp: Quarkusエクステンション

source: Quarkus extension dependencies are divided into the runtime extension dependencies that end up on the application runtime classpath and the deployment (or build time) extension dependencies that are resolved by Quarkus only at application build time to create the build classpath. Application developers are expected to express dependencies only on the runtime artifacts of Quarkus extensions.
ja_jp: Quarkusのエクステンションの依存関係は、アプリケーションの実行時クラスパス上で終わる実行時エクステンションの依存関係と、ビルドクラスパスを作成するためにアプリケーションのビルド時にQuarkusによってのみ解決されるデプロイメント（またはビルド時）エクステンションの依存関係に分けられます。アプリケーション開発者は、Quarkusのエクステンションの実行時アーティファクトにのみ依存関係を表現することが期待されます。
